  # PANDAS

In [1]:
# Import pandas and lable it as 'pd' "as alias"

import pandas as pd

In [2]:

# Read data via 'pd.read_csv'
# Use the appropriate read function for different file formats,
#for example pd.read_excel allows you to import files in excel format

train = pd.read_csv('titanic_train.csv')
test = pd.read_csv('titanic_test.csv')

In [3]:
# 'head' shows the first five rows of the dataframe by default but you can specify the number of rows in the parenthesis

train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
# 'tail' shows the bottom five rows by default

train.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [5]:
# 'shape' function tells us how many rows and columns exist in a dataframe

train.shape

(891, 12)

# HOW TO READ TSV FILE

In [6]:
draft2 = pd.read_table('test.tsv') # read a tsv into a DataFrame

draft2

     a     b       c        d       e   f
0  meg  qual   benga      job  sweden NaN
1  ash    AI  mumbai  startup      uk NaN

In [7]:
df = pd.read_csv("test.tsv",sep="\t")
df

     a     b       c        d       e   f
0  meg  qual   benga      job  sweden NaN
1  ash    AI  mumbai  startup      uk NaN

# HOW TO READ TEXT FILE

In [9]:
draft3 = pd.read_table("ex3.txt")
draft3

               A         B         C
0  aaa -0.264438 -1.026059 -0.619500
1  bbb  0.927272  0.302904 -0.032399
2  ccc -0.264273 -0.386314 -0.217601
3  ddd -0.871858 -0.348382  1.100491

In [10]:
data = pd.read_csv('ex1.csv')
data

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [11]:
df2 = pd.read_csv('ex1.csv',header=None) 
df2

   0   1   2   3        4
0  a   b   c   d  message
1  1   2   3   4    hello
2  5   6   7   8    world
3  9  10  11  12      foo

In [12]:
df3 = pd.read_csv('ex1.csv', header=None, names = ["Name" , "Age" , "Height" , "Weight" , "Academic"])
df3

  Name Age Height Weight Academic
0    a   b      c      d  message
1    1   2      3      4    hello
2    5   6      7      8    world
3    9  10     11     12      foo

In [18]:
df = pd.read_csv("csv_mindex.csv")
df

  key1 key2  value1  value2
0  one    a       1       2
1  one    b       3       4
2  one    c       5       6
3  one    d       7       8
4  two    a       9      10
5  two    b      11      12
6  two    c      13      14
7  two    d      15      16

In [19]:
df.index

RangeIndex(start=0, stop=8, step=1)

In [21]:
df.columns

Index(['key1', 'key2', 'value1', 'value2'], dtype='object')

In [25]:
df5 = pd.read_csv("csv_mindex.csv",index_col = ["key1"])
df5

     key2  value1  value2
key1
one     a       1       2
one     b       3       4
one     c       5       6
one     d       7       8
two     a       9      10
two     b      11      12
two     c      13      14
two     d      15      16

# CREATING YOUR OWN DATAFRAME

In [27]:
# Number entries

test_scores =  pd.DataFrame({'Student_ID':[154,973,645], 'Science':[50,75,31], 'Geography':[88,100,66],
                              'Math':[72,86,94]})
test_scores

   Student_ID  Science  Geography  Math
0         154       50         88    72
1         973       75        100    86
2         645       31         66    94

In [29]:
# Text Entries

survey = pd.DataFrame({'James':['I liked it','It could use a bit more salt'], 'Emily':['It is too sweet','Yum!']})
survey

                          James            Emily
0                    I liked it  It is too sweet
1  It could use a bit more salt             Yum!

# Index

In [30]:
test_scores = test_scores.set_index('Student_ID')
test_scores

            Science  Geography  Math
Student_ID
154              50         88    72
973              75        100    86
645              31         66    94

In [31]:
survey = pd.DataFrame({'James':['I liked it','It could use a bit more salt'], 'Emily':['It is too sweet','Yum!']},
                      index = ['Product A' , 'Product B'])
survey

                                  James            Emily
Product A                    I liked it  It is too sweet
Product B  It could use a bit more salt             Yum!

In [32]:
# Reset index
# Try playing around with 'drop' and 'inplace
survey.reset_index(drop = True)

                          James            Emily
0                    I liked it  It is too sweet
1  It could use a bit more salt             Yum!

In [33]:
survey

                                  James            Emily
Product A                    I liked it  It is too sweet
Product B  It could use a bit more salt             Yum!

In [35]:
survey.reset_index(drop = True,inplace = True)
survey

                          James            Emily
0                    I liked it  It is too sweet
1  It could use a bit more salt             Yum!

# Renaming columns

In [36]:
# Suppose we want to change the names of the first two columns

test_scores.rename(columns = {'Geography': 'Physics', 'Science':'Arts'}, inplace = True)
test_scores

            Arts  Physics  Math
Student_ID
154           50       88    72
973           75      100    86
645           31       66    94

# DROPPING COLUMNS AND ROWS

In [37]:
# drop the ' Math' column

test_scores.drop(columns = 'Math', inplace = True)
test_scores   # this should be run only one time otherwise it will show not defined

            Arts  Physics
Student_ID
154           50       88
973           75      100
645           31       66

In [39]:
# Drop row with student_ID 973
# we can make this more robust once we learn the 'Loc' function in the coming weeks

test_scores.drop(973, inplace = True)
test_scores

            Arts  Physics
Student_ID
154           50       88
645           31       66

# 2 nd class

# SERIES

In [5]:
import pandas as pd
pd.Series([1,2,3,4,5])

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [6]:
profit = pd.Series([75,80,66], index = ['2018 Profit', '2019 Profit', '2020 Profit'])
profit

2018 Profit    75
2019 Profit    80
2020 Profit    66
dtype: int64

In [9]:
customer_sales = pd.DataFrame([[317, 'Melbourn','80'], [887, 'New York','91'],[225,'London','50']],columns = ['Customer_ID', 'City','Sales'])
customer_sales

   Customer_ID      City Sales
0          317  Melbourn    80
1          887  New York    91
2          225    London    50